# IPA Symbols for English Syllabification
cons_s = [
    'p', 'pʰ', 'b', 
    't', 'tʰ', 'd', 
    'k', 'kʰ', 'g', 'ɡ',
    'm', 'n', 
    'f', 'v', 'θ', 'ð', 
    's', 'z', 'ʃ', 'ʒ', 'h', 
    'tʃ', 'dʒ', 
    'ɹ', 'r', 'l', 'w', 'j'
]

cons_e = [
    'm', 'n', 'ŋ'
]

vowels = [
    'i', 'y', 'u', 'ɪ', 'ʊ',
    'e', 'ø', 'o', 'ə', 'ɤ',
    'ɛ', 'œ', 'ʌ', 'ɔ', 
    'æ', 'a', 'ɶ', 'ɑ', 'ɒ',
    'ɨ', 'ʉ', 'ɯ', 'z̩', 'ʐ̩', 'ɻ̩', 'ɚ', 'ɝ', 'ɜ',

    'i̯', 'u̯', 'y̯', 
    'ai', 'ei', 'ao', 'ou',
    'ia', 'ie', 'iao', 'iu',
    'ua', 'uo', 'uai', 'ui',
    'üe', 'üa', 'ü', 
    'aɪ', 'eɪ', 'aʊ', 'oʊ', 'ɔɪ', 'ju',
    
    'i̯ɛ', 'i̯ɑ', 'i̯ɑu', 'i̯oʊ', 'i̯a', 'i̯ae',
    'u̯ɔ', 'u̯ai', 'u̯ei', 'u̯a', 'u̯ə', 'u̯ɑ', 'u̯ɤ',
    'y̯ɛ', 'y̯a', 'y̯œ', 
    'y̯',
    
]
